let lists

date = {
  "date": [
      {
          "Наименование": "Микросхема, видеочип, мультиконтроллер, контроллер питания, процессор, чип, шим-контроллер",
          "Нетто": "0.008",
          "Брутто": "0.01",
          "ТНВЭД": "8542319090"
      },
      {
          "Наименование": "Северный мост",
          "Нетто": "0.02",
          "Брутто": "0.03",
          "ТНВЭД": "8542319090"
      },
      {
          "Наименование": "Bluetooth гарнитура ",
          "Нетто": "0.095",
          "Брутто": "0.105",
          "ТНВЭД": "8518309500"
      },
      {
          "Наименование": "Гарнитура",
          "Нетто": "0.016",
          "Брутто": "0.03",
          "ТНВЭД": "8518309500"
      },
      {
          "Наименование": "Коннектор под витую пару",
          "Нетто": "0.002",
          "Брутто": "0.005",
          "ТНВЭД": "8536901000"
      },
      {
          "Наименование": "Кабель FTP , UTP ",
          "Нетто": "0.01",
          "Брутто": "0.02",
          "ТНВЭД": "8544492000"
      },
      {
          "Наименование": "USB кабель ",
          "Нетто": "0.022",
          "Брутто": "0.037",
          "ТНВЭД": "8544429007"
      },
      {
          "Наименование": "Кабель VIXION",
          "Нетто": "0.02",
          "Брутто": "0.03",
          "ТНВЭД": "8544429007"
      },
      {
          "Наименование": "Кабель для блока питания ",
          "Нетто": "0.01",
          "Брутто": "0.02",
          "ТНВЭД": "8544429007"
      },
      {
          "Наименование": "Патч-корд Cabeus 0.15 м",
          "Нетто": "0.005",
          "Брутто": "0.011",
          "ТНВЭД": "8544429007"
      },
      {
          "Наименование": "Патч-корд Cabeus 0.3 м",
          "Нетто": "0.01",
          "Брутто": "0.016",
          "ТНВЭД": "8544429007"
      },
      {
          "Наименование": "Патч-корд RJ45 - RJ45, 4 пары, 3 м",
          "Нетто": "0.105",
          "Брутто": "0.11",
          "ТНВЭД": "8544429007"
      },
      {
          "Наименование": "Сетевой кабель EURO",
          "Нетто": "1.8",
          "Брутто": "2.3",
          "ТНВЭД": "8544429007"
      },
      {
          "Наименование": "Патч-корд RJ45 - RJ45, 4 пары, 0.5 м",
          "Нетто": "0.018",
          "Брутто": "0.024",
          "ТНВЭД": "8544700000"
      },
      {
          "Наименование": "Защитное стекло",
          "Нетто": "0.005",
          "Брутто": "0.01",
          "ТНВЭД": "7020008000"
      },
      {
          "Наименование": "Защитное стекло для ноутбука/планшета",
          "Нетто": "0.01",
          "Брутто": "0.02",
          "ТНВЭД": "7020008000"
      },
      {
          "Наименование": "Стекло для мобильного устройства",
          "Нетто": "0.027",
          "Брутто": "0.05",
          "ТНВЭД": "7020008000"
      },
      {
          "Наименование": "Стекло для переклейки для мобильного устройства",
          "Нетто": "0.027",
          "Брутто": "0.05",
          "ТНВЭД": "7020008000"
      },
      {
          "Наименование": "Стекло для планшета/ноутбука",
          "Нетто": "0.1",
          "Брутто": "0.12",
          "ТНВЭД": "7020008000"
      },
      {
          "Наименование": "Держатель SIM карт",
          "Нетто": "0.0005",
          "Брутто": "0.001",
          "ТНВЭД": "8517709009"
      },
      {
          "Наименование": "Динамик для телефонов",
          "Нетто": "0.0005",
          "Брутто": "0.001",
          "ТНВЭД": "8517709009"
      },
      {
          "Наименование": "Динамик слуховой для телефонов",
          "Нетто": "0.0005",
          "Брутто": "0.001",
          "ТНВЭД": "8517709009"
      },
      {
          "Наименование": "Дисплей для телефона",
          "Нетто": "0.005",
          "Брутто": "0.01",
          "ТНВЭД": "8517709009"
      },
      {
          "Наименование": "Задняя крышка",
          "Нетто": "0.05",
          "Брутто": "0.08",
          "ТНВЭД": "8517709009"
      },
      {
          "Наименование": "Модуль (матрица+тачскрин) для телефона",
          "Нетто": "0.05",
          "Брутто": "0.065",
          "ТНВЭД": "8517709009"
      },
      {
          "Наименование": "Набор заглушек",
          "Нетто": "0.01",
          "Брутто": "0.012",
          "ТНВЭД": "8517709009"
      },
      {
          "Наименование": "Плата разъема питания ",
          "Нетто": "0.03",
          "Брутто": "0.05",
          "ТНВЭД": "8517709009"
      },
      {
          "Наименование": "Полифонический динамик для телефона",
          "Нетто": "0.003",
          "Брутто": "0.005",
          "ТНВЭД": "8517709009"
      },
      {
          "Наименование": "Разъем для телефона ",
          "Нетто": "0.005",
          "Брутто": "0.007",
          "ТНВЭД": "8517709009"
      },
      {
          "Наименование": "Рамка дисплея для телефона",
          "Нетто": "0.04",
          "Брутто": "0.045",
          "ТНВЭД": "8517709009"
      },
      {
          "Наименование": "Сеточка динамика",
          "Нетто": "0.002",
          "Брутто": "0.005",
          "ТНВЭД": "8517709009"
      },
      {
          "Наименование": "Тачскрин (сенсорное стекло) для мобильного устройства",
          "Нетто": "0.1",
          "Брутто": "0.17",
          "ТНВЭД": "8517709009"
      },
      {
          "Наименование": "Шлейф для мобильного телефона",
          "Нетто": "0.01",
          "Брутто": "0.02",
          "ТНВЭД": "8517709009"
      },
      {
          "Наименование": "Аэрозоль Solins DUSTER, 400 мл, пр-во Россия",
          "Нетто": "0.15",
          "Брутто": "0.17",
          "ТНВЭД": "2711140009"
      },
      {
          "Наименование": "Аэрозоль Solins FREEZER, 400 мл, пр-во Россия",
          "Нетто": "0.3",
          "Брутто": "0.32",
          "ТНВЭД": "2711140009"
      },
      {
          "Наименование": "Аэрозоль Solins FLUX OFF , пр-во Россия",
          "Нетто": "0.3",
          "Брутто": "0.35",
          "ТНВЭД": "3814009000"
      },
      {
          "Наименование": "Аэрозоль Solins LABEL-OFF, 200 мл, пр-во Россия ",
          "Нетто": "0.158",
          "Брутто": "0.17",
          "ТНВЭД": "3814009000"
      },
      {
          "Наименование": "Аэрозоль Solins PLASTIK 71, 150 мл, пр-во Россия",
          "Нетто": "0.121",
          "Брутто": "0.133",
          "ТНВЭД": "3208209009"
      },
      {
          "Наименование": "Аэрозоль Solins PLASTIK 71, 400 мл, пр-во Россия",
          "Нетто": "0.32",
          "Брутто": "0.44",
          "ТНВЭД": "3208209009"
      },
      {
          "Наименование": "USB HUB ",
          "Нетто": "0.035",
          "Брутто": "0.048",
          "ТНВЭД": "8517620009"
      },
      {
          "Наименование": "USB Flash накопитель, пр-во Тайвань",
          "Нетто": "0.1",
          "Брутто": "0.2",
          "ТНВЭД": "8523511000"
      },
      {
          "Наименование": "Карта памяти SmartBuy , пр-во Тайвань",
          "Нетто": "0.15",
          "Брутто": "0.2",
          "ТНВЭД": "8523511000"
      },
      {
          "Наименование": "Адаптер оптический ",
          "Нетто": "0.08",
          "Брутто": "0.1",
          "ТНВЭД": "8536700001"
      },
      {
          "Наименование": "Аккумулятор для акустики ",
          "Нетто": "0.096",
          "Брутто": "0.106",
          "ТНВЭД": "8507800000"
      },
      {
          "Наименование": "Аккумулятор для гироскутера",
          "Нетто": "0.35",
          "Брутто": "0.45",
          "ТНВЭД": "8507800000"
      },
      {
          "Наименование": "Аккумулятор для КПК",
          "Нетто": "0.1",
          "Брутто": "0.2",
          "ТНВЭД": "8507800000"
      },
      {
          "Наименование": "Аккумулятор для ноутбуков/планшетов",
          "Нетто": "0.5",
          "Брутто": "0.6",
          "ТНВЭД": "8507800000"
      },
      {
          "Наименование": "Аккумулятор для пылесоса/полотера",
          "Нетто": "0.5",
          "Брутто": "0.6",
          "ТНВЭД": "8507800000"
      },
      {
          "Наименование": "Аккумулятор для рации/радиостанции/радиотелефона",
          "Нетто": "0.1",
          "Брутто": "0.2",
          "ТНВЭД": "8507800000"
      },
      {
          "Наименование": "Аккумулятор для телефонов",
          "Нетто": "0.05",
          "Брутто": "0.06",
          "ТНВЭД": "8507800000"
      },
      {
          "Наименование": "Аккумулятор для фото/видео",
          "Нетто": "0.1",
          "Брутто": "0.15",
          "ТНВЭД": "8507800000"
      },
      {
          "Наименование": "Аккумулятор для электроинструмента",
          "Нетто": "0.04",
          "Брутто": "0.05",
          "ТНВЭД": "8507800000"
      },
      {
          "Наименование": "Аккумулятор универсальный",
          "Нетто": "0.03",
          "Брутто": "0.035",
          "ТНВЭД": "8507800000"
      },
      {
          "Наименование": "Аккумуляторы АА, ААА",
          "Нетто": "0.03",
          "Брутто": "0.04",
          "ТНВЭД": "8507800000"
      },
      {
          "Наименование": "Элемент питания",
          "Нетто": "0.005",
          "Брутто": "0.006",
          "ТНВЭД": "8506808000"
      },
      {
          "Наименование": "Элемент питания, пр-во Гонконг",
          "Нетто": "0.005",
          "Брутто": "0.006",
          "ТНВЭД": "8506808000"
      },
      {
          "Наименование": "Элемент питания, пр-во США",
          "Нетто": "0.005",
          "Брутто": "0.006",
          "ТНВЭД": "8506808000"
      },
      {
          "Наименование": "Элемент питания, пр-во Япония",
          "Нетто": "0.005",
          "Брутто": "0.006",
          "ТНВЭД": "8506808000"
      },
      {
          "Наименование": "Элемент питания, пр-во Швейцария",
          "Нетто": "0.005",
          "Брутто": "0.006",
          "ТНВЭД": "8506808000"
      },
      {
          "Наименование": "Автомобильное ЗУ для терминала",
          "Нетто": "0.2",
          "Брутто": "0.3",
          "ТНВЭД": "8504405500"
      },
      {
          "Наименование": "Блок питания для гироскутера",
          "Нетто": "0.8",
          "Брутто": "1",
          "ТНВЭД": "8504405500"
      },
      {
          "Наименование": "Блок питания для монитора",
          "Нетто": "0.3",
          "Брутто": "0.4",
          "ТНВЭД": "8504405500"
      },
      {
          "Наименование": "Блок питания для ноутбуков/планшетов",
          "Нетто": "0.3",
          "Брутто": "0.5",
          "ТНВЭД": "8504405500"
      },
      {
          "Наименование": "Блок питания универсальный ",
          "Нетто": "0.25",
          "Брутто": "0.3",
          "ТНВЭД": "8504405500"
      },
      {
          "Наименование": "Зарядное устройство для аккумуляторов",
          "Нетто": "0.2",
          "Брутто": "0.3",
          "ТНВЭД": "8504405500"
      },
      {
          "Наименование": "Зарядное устройство для электротранспорта",
          "Нетто": "0.8",
          "Брутто": "1",
          "ТНВЭД": "8504405500"
      },
      {
          "Наименование": "СЗУ + кабель",
          "Нетто": "0.12",
          "Брутто": "0.15",
          "ТНВЭД": "8504405500"
      },
      {
          "Наименование": "Бокс для жесткого диска  USB  алюминиевый",
          "Нетто": "0.02",
          "Брутто": "0.04",
          "ТНВЭД": "7616999008"
      },
      {
          "Наименование": "Бокс для жесткого диска  USB  пластиковый",
          "Нетто": "0.02",
          "Брутто": "0.04",
          "ТНВЭД": "3926909709"
      },
      {
          "Наименование": "Кабельный органайзер",
          "Нетто": "0.14",
          "Брутто": "0.17",
          "ТНВЭД": "3926909709"
      },
      {
          "Наименование": "Коробка настенная на 1 адаптер",
          "Нетто": "1.5",
          "Брутто": "1.6",
          "ТНВЭД": "3926909709"
      },
      {
          "Наименование": "Крышка экрана матрицы для ноутбука",
          "Нетто": "0.2",
          "Брутто": "0.3",
          "ТНВЭД": "3926909709"
      },
      {
          "Наименование": "Медиатор пластиковый",
          "Нетто": "0.01",
          "Брутто": "0.015",
          "ТНВЭД": "3926909709"
      },
      {
          "Наименование": "Панель ящика морозильной камеры холодильника ",
          "Нетто": "0.25",
          "Брутто": "0.3",
          "ТНВЭД": "3926909709"
      },
      {
          "Наименование": "Прокладка для IPhone водонепроницаемая ",
          "Нетто": "0.005",
          "Брутто": "0.01",
          "ТНВЭД": "3926909709"
      },
      {
          "Наименование": "Вазелин, пр-во Россия",
          "Нетто": "0.02",
          "Брутто": "0.03",
          "ТНВЭД": "2710198600"
      },
      {
          "Наименование": "Ваттметр",
          "Нетто": "0.15",
          "Брутто": "0.3",
          "ТНВЭД": "9030331000"
      },
      {
          "Наименование": "Вентилятор (кулер)",
          "Нетто": "0.1",
          "Брутто": "0.15",
          "ТНВЭД": "8414592000"
      },
      {
          "Наименование": "Винты для телефона комплект",
          "Нетто": "0.02",
          "Брутто": "0.026",
          "ТНВЭД": "7318159009"
      },
      {
          "Наименование": "Выключатель MAKEL, пр-во Турция",
          "Нетто": "0.014",
          "Брутто": "0.05",
          "ТНВЭД": "8536507000"
      },
      {
          "Наименование": "Гермоввод для кабеля",
          "Нетто": "0.019",
          "Брутто": "0.023",
          "ТНВЭД": "8547900000"
      },
      {
          "Наименование": "Дихлорэтан 30мл, пр-во Россия",
          "Нетто": "0.03",
          "Брутто": "0.04",
          "ТНВЭД": "2903150000"
      },
      {
          "Наименование": "Дихлорэтан 500мл, пр-во Россия",
          "Нетто": "0.5",
          "Брутто": "0.515",
          "ТНВЭД": "2903150000"
      },
      {
          "Наименование": "Железо хлорное 6-водное FeCI3(банка ПЭ-0,5кг), пр-во Россия",
          "Нетто": "0.5",
          "Брутто": "0.515",
          "ТНВЭД": "2827392000"
      },
      {
          "Наименование": "Жидкая термопрокладка, 20г, пр-во Греция",
          "Нетто": "0.02",
          "Брутто": "0.025",
          "ТНВЭД": "3824999609"
      },
      {
          "Наименование": "Жиклеры, пр-во Италия",
          "Нетто": "0.025",
          "Брутто": "0.03",
          "ТНВЭД": "7318190009"
      },
      {
          "Наименование": "Жиклеры, набор",
          "Нетто": "0.075",
          "Брутто": "0.08",
          "ТНВЭД": "7318190009"
      },
      {
          "Наименование": "Защитная пленка ",
          "Нетто": "0.002",
          "Брутто": "0.003",
          "ТНВЭД": "3919900000"
      },
      {
          "Наименование": "Изопропиловый спирт 1л, пр-во Россия",
          "Нетто": "0.8",
          "Брутто": "0.815",
          "ТНВЭД": "2905120000"
      },
      {
          "Наименование": "Инвертор",
          "Нетто": "2.55",
          "Брутто": "2.85",
          "ТНВЭД": "8504408400"
      },
      {
          "Наименование": "Камера для телефона",
          "Нетто": "0.003",
          "Брутто": "0.005",
          "ТНВЭД": "8525803000"
      },
      {
          "Наименование": "Канифоль 20 г",
          "Нетто": "0.02",
          "Брутто": "0.04",
          "ТНВЭД": "3806100000"
      },
      {
          "Наименование": "Керамическая пленка (стекло) ",
          "Нетто": "0.005",
          "Брутто": "0.01",
          "ТНВЭД": "6914900000"
      },
      {
          "Наименование": "Ортофосфорная кислота 30мл, содержание пятиокиси фосфора 0,081 грамм, пр-во Россия",
          "Нетто": "0.056",
          "Брутто": "0.07",
          "ТНВЭД": "2809200000"
      },
      {
          "Наименование": "Клавиатура",
          "Нетто": "0.3",
          "Брутто": "0.4",
          "ТНВЭД": "8471606000"
      },
      {
          "Наименование": "Клей 110 мл",
          "Нетто": "0.15",
          "Брутто": "0.2",
          "ТНВЭД": "3506100000"
      },
      {
          "Наименование": "Клей 15 мл",
          "Нетто": "0.05",
          "Брутто": "0.1",
          "ТНВЭД": "3506100000"
      },
      {
          "Наименование": "Клей 50 мл",
          "Нетто": "0.075",
          "Брутто": "0.085",
          "ТНВЭД": "3506100000"
      },
      {
          "Наименование": "Ультрафиолетовый клей 10мл",
          "Нетто": "0.015",
          "Брутто": "0.02",
          "ТНВЭД": "3506100000"
      },
      {
          "Наименование": "Клей БФ-2 100 мл, пр-во Россия",
          "Нетто": "0.07",
          "Брутто": "0.08",
          "ТНВЭД": "3506100000"
      },
      {
          "Наименование": "Клей теплопроводный, пр-во Россия",
          "Нетто": "0.002",
          "Брутто": "0.005",
          "ТНВЭД": "3506100000"
      },
      {
          "Наименование": "Коврик антистатический",
          "Нетто": "0.15",
          "Брутто": "0.25",
          "ТНВЭД": "3926909200"
      },
      {
          "Наименование": "Коврик для мыши",
          "Нетто": "0.057",
          "Брутто": "0.07",
          "ТНВЭД": "4016999708"
      },
      {
          "Наименование": "Лабораторный источник (блок) питания ",
          "Нетто": "1.901",
          "Брутто": "2",
          "ТНВЭД": "8504409000"
      },
      {
          "Наименование": "Лак Цапон 22 мл, пр-во Россия",
          "Нетто": "0.022",
          "Брутто": "0.03",
          "ТНВЭД": "3209900000"
      },
      {
          "Наименование": "Лак Цапон 30 мл, пр-во Россия",
          "Нетто": "0.03",
          "Брутто": "0.038",
          "ТНВЭД": "3209900000"
      },
      {
          "Наименование": "Лампа светодиодная",
          "Нетто": "0.065",
          "Брутто": "0.07",
          "ТНВЭД": "8539500009"
      },
      {
          "Наименование": "Лента термостойкая ширина 10 мм",
          "Нетто": "0.05",
          "Брутто": "0.06",
          "ТНВЭД": "3919108000"
      },
      {
          "Наименование": "Скотч  двухсторонний прозрачный 2мм*10 м",
          "Нетто": "0.04",
          "Брутто": "0.055",
          "ТНВЭД": "3919108000"
      },
      {
          "Наименование": "Скотч  двухсторонний прозрачный 55 м",
          "Нетто": "0.155",
          "Брутто": "0.21",
          "ТНВЭД": "3919108000"
      },
      {
          "Наименование": "Скотч  двухсторонний прозрачный/черный 2мм*50 м",
          "Нетто": "0.14",
          "Брутто": "0.145",
          "ТНВЭД": "3919108000"
      },
      {
          "Наименование": "Термоскотч 15 мм",
          "Нетто": "0.045",
          "Брутто": "0.055",
          "ТНВЭД": "3919108000"
      },
      {
          "Наименование": "Термоскотч 20 мм",
          "Нетто": "0.055",
          "Брутто": "0.065",
          "ТНВЭД": "3919108000"
      },
      {
          "Наименование": "Манжета люка стиральной машины",
          "Нетто": "0.125",
          "Брутто": "0.13",
          "ТНВЭД": "4016930005"
      },
      {
          "Наименование": "Уплотнитель двери холодильника",
          "Нетто": "0.4",
          "Брутто": "0.5",
          "ТНВЭД": "4016930005"
      },
      {
          "Наименование": "Матрица",
          "Нетто": "0.5",
          "Брутто": "0.6",
          "ТНВЭД": "8473"
      },
      {
          "Наименование": "Модуль (матрица+тачскрин) для ноутбука/планшета",
          "Нетто": "0.4",
          "Брутто": "0.5",
          "ТНВЭД": "8473"
      },
      {
          "Наименование": "Переходник SATA на SSD ",
          "Нетто": "0.135",
          "Брутто": "0.15",
          "ТНВЭД": "8473"
      },
      {
          "Наименование": "Переходник для матриц",
          "Нетто": "0.03",
          "Брутто": "0.035",
          "ТНВЭД": "8473"
      },
      {
          "Наименование": "Петли для ноутбука",
          "Нетто": "0.03",
          "Брутто": "0.04",
          "ТНВЭД": "8473"
      },
      {
          "Наименование": "Разъем питания для ноутбуков с кабелем",
          "Нетто": "0.03",
          "Брутто": "0.04",
          "ТНВЭД": "8473"
      },
      {
          "Наименование": "Тачскрин для планшета, ноутбука",
          "Нетто": "0.3",
          "Брутто": "0.4",
          "ТНВЭД": "8473"
      },
      {
          "Наименование": "Топкейс с клавиатурой",
          "Нетто": "0.3",
          "Брутто": "0.4",
          "ТНВЭД": "8473"
      },
      {
          "Наименование": "Шлейф для ноутбука/планшета",
          "Нетто": "0.05",
          "Брутто": "0.1",
          "ТНВЭД": "8473"
      },
      {
          "Наименование": "Медная лента-фольга 30mm",
          "Нетто": "0.3",
          "Брутто": "0.35",
          "ТНВЭД": "7410110000"
      },
      {
          "Наименование": "Медная проволока для восстановления дорожек ",
          "Нетто": "0.05",
          "Брутто": "0.07",
          "ТНВЭД": "7408199000"
      },
      {
          "Наименование": "Мешки для пылесоса, пр-во Россия",
          "Нетто": "0.07",
          "Брутто": "0.08",
          "ТНВЭД": "5911909000"
      },
      {
          "Наименование": "Модуль SPF оптический трансивер",
          "Нетто": "0.17",
          "Брутто": "0.19",
          "ТНВЭД": "8517620003"
      },
      {
          "Наименование": "Модуль  памяти",
          "Нетто": "0.016",
          "Брутто": "0.03",
          "ТНВЭД": "8471702000"
      },
      {
          "Наименование": "Мотор для пылесоса",
          "Нетто": "0.5",
          "Брутто": "0.6",
          "ТНВЭД": "8501200009"
      },
      {
          "Наименование": "Мышь компьютерная",
          "Нетто": "0.25",
          "Брутто": "0.5",
          "ТНВЭД": "8471607000"
      },
      {
          "Наименование": "Набор инструментов",
          "Нетто": "0.3",
          "Брутто": "0.347",
          "ТНВЭД": "8205909000"
      },
      {
          "Наименование": "Набор инструментов для вскрытия телефонов",
          "Нетто": "0.11",
          "Брутто": "0.15",
          "ТНВЭД": "8205909000"
      },
      {
          "Наименование": "Набор инструментов для разборки телефонов и планшетов",
          "Нетто": "0.3",
          "Брутто": "0.5",
          "ТНВЭД": "8205909000"
      },
      {
          "Наименование": "Набор лопаток",
          "Нетто": "0.15",
          "Брутто": "0.159",
          "ТНВЭД": "7326909807"
      },
      {
          "Наименование": "Набор отверток",
          "Нетто": "0.25",
          "Брутто": "0.5",
          "ТНВЭД": "8205400000"
      },
      {
          "Наименование": "Отвертка ",
          "Нетто": "0.1",
          "Брутто": "0.12",
          "ТНВЭД": "8205400000"
      },
      {
          "Наименование": "Отвертка с набором бит",
          "Нетто": "0.25",
          "Брутто": "0.393",
          "ТНВЭД": "8205400000"
      },
      {
          "Наименование": "Наклейка аккумулятора для iPhone",
          "Нетто": "0.008",
          "Брутто": "0.01",
          "ТНВЭД": "3919900000"
      },
      {
          "Наименование": "Оплетка  3mm*2m",
          "Нетто": "0.27",
          "Брутто": "0.3",
          "ТНВЭД": "7413000008"
      },
      {
          "Наименование": "Аэрозоль SOLINS GRAPHITE, 200 мл, пр-во Россия",
          "Нетто": "0.32",
          "Брутто": "0.44",
          "ТНВЭД": "3801209000"
      },
      {
          "Наименование": "Паяльная паста 50 г",
          "Нетто": "0.05",
          "Брутто": "0.056",
          "ТНВЭД": "3810100000"
      },
      {
          "Наименование": "Паяльная кислота",
          "Нетто": "0.035",
          "Брутто": "0.045",
          "ТНВЭД": "3810909000"
      },
      {
          "Наименование": "Паяльная станция LUKEY 702 ",
          "Нетто": "2.7",
          "Брутто": "3",
          "ТНВЭД": "8515190000"
      },
      {
          "Наименование": "Паяльная станция LUKEY 852",
          "Нетто": "5",
          "Брутто": "5.5",
          "ТНВЭД": "8515190000"
      },
      {
          "Наименование": "Паяльная станция YIHUA ",
          "Нетто": "4",
          "Брутто": "4.4",
          "ТНВЭД": "8515190000"
      },
      {
          "Наименование": "Паяльник ЭПСН, пр-во Россия",
          "Нетто": "0.18",
          "Брутто": "0.21",
          "ТНВЭД": "8515110000"
      },
      {
          "Наименование": "Переходник SATA на шнурке",
          "Нетто": "0.06",
          "Брутто": "0.065",
          "ТНВЭД": "8536908500"
      },
      {
          "Наименование": "Паяльная станция DSK T12-D OLED, пр-во Россия",
          "Нетто": "4",
          "Брутто": "4.4",
          "ТНВЭД": "8515190000"
      },
      {
          "Наименование": "Пигтейл LC, UPC, одномодовый, 1.5 м, пр-во Россия",
          "Нетто": "0.053",
          "Брутто": "0.058",
          "ТНВЭД": "8544700000"
      },
      {
          "Наименование": "Пигтейл LC, UPC, одномодовый, 1.5 м",
          "Нетто": "0.053",
          "Брутто": "0.058",
          "ТНВЭД": "8544700000"
      },
      {
          "Наименование": "Помпа для стиральной машины с алюминиевой обмоткой",
          "Нетто": "0.405",
          "Брутто": "0.45",
          "ТНВЭД": "8413708100"
      },
      {
          "Наименование": "Припой ПОС 100 г",
          "Нетто": "0.1",
          "Брутто": "0.15",
          "ТНВЭД": "8311300000"
      },
      {
          "Наименование": "Припой ПОС 50 г",
          "Нетто": "0.05",
          "Брутто": "0.06",
          "ТНВЭД": "8311300000"
      },
      {
          "Наименование": "Припой ПОС диаметр  1,5мм 1 м",
          "Нетто": "0.018",
          "Брутто": "0.023",
          "ТНВЭД": "8311300000"
      },
      {
          "Наименование": "Припой ПОС диаметр 0,8 мм 1м",
          "Нетто": "0.01",
          "Брутто": "0.015",
          "ТНВЭД": "8311300000"
      },
      {
          "Наименование": "Припой ПОС 1мм 1 м",
          "Нетто": "0.022",
          "Брутто": "0.033",
          "ТНВЭД": "8311300000"
      },
      {
          "Наименование": "Растворитель \"Калоша\" 1л, пр-во Россия",
          "Нетто": "0.7",
          "Брутто": "0.73",
          "ТНВЭД": "3814009000"
      },
      {
          "Наименование": "Ремень для стиральной/сушильной машины",
          "Нетто": "0.4",
          "Брутто": "0.5",
          "ТНВЭД": "4010390000"
      },
      {
          "Наименование": "Ремешок силиконовый",
          "Нетто": "0.05",
          "Брутто": "0.06",
          "ТНВЭД": "9113900009"
      },
      {
          "Наименование": "Розетка, пр-во Тайвань",
          "Нетто": "0.05",
          "Брутто": "0.1",
          "ТНВЭД": "8536699008"
      },
      {
          "Наименование": "Розетка настенная",
          "Нетто": "0.05",
          "Брутто": "0.1",
          "ТНВЭД": "8536699008"
      },
      {
          "Наименование": "Сальник стиральной машины",
          "Нетто": "0.3",
          "Брутто": "0.33",
          "ТНВЭД": "4016999109"
      },
      {
          "Наименование": "Сальник стиральной машины, пр-во Италия",
          "Нетто": "0.3",
          "Брутто": "0.33",
          "ТНВЭД": "4016999109"
      },
      {
          "Наименование": "Сетевой разветвитель, пр-во Беларусь",
          "Нетто": "0.14",
          "Брутто": "0.15",
          "ТНВЭД": "8536699008"
      },
      {
          "Наименование": "Силиконовая смазка, пр-во Россия",
          "Нетто": "0.002",
          "Брутто": "0.01",
          "ТНВЭД": "3910000008"
      },
      {
          "Наименование": "Силиконовый чехол",
          "Нетто": "0.15",
          "Брутто": "0.2",
          "ТНВЭД": "4202921900"
      },
      {
          "Наименование": "Сканер отпечатка  телефон",
          "Нетто": "0.005",
          "Брутто": "0.02",
          "ТНВЭД": "8471607000"
      },
      {
          "Наименование": "Смазка для сальников 50 г",
          "Нетто": "0.05",
          "Брутто": "0.055",
          "ТНВЭД": "3403990000"
      },
      {
          "Наименование": "Стекло камеры для телефона",
          "Нетто": "0.005",
          "Брутто": "0.01",
          "ТНВЭД": "7006009000"
      },
      {
          "Наименование": "MP3 плеер ",
          "Нетто": "0.05",
          "Брутто": "0.06",
          "ТНВЭД": "8519814500"
      },
      {
          "Наименование": "Таходатчик для стиральной машины",
          "Нетто": "0.1",
          "Брутто": "0.17",
          "ТНВЭД": "9029900009"
      },
      {
          "Наименование": "Тачпад для ноутбука, пр-во Россия",
          "Нетто": "0.1",
          "Брутто": "0.17",
          "ТНВЭД": "8471607000"
      },
      {
          "Наименование": "Термопрокладка 0,5x15x15mm 5 штук",
          "Нетто": "0.02",
          "Брутто": "0.022",
          "ТНВЭД": "8545909000"
      },
      {
          "Наименование": "Термопрокладка 1,5x15x15mm 5 штук",
          "Нетто": "0.05",
          "Брутто": "0.053",
          "ТНВЭД": "8545909000"
      },
      {
          "Наименование": "Темопрокладка 10мм*10мм толщина 4 мм 100шт.",
          "Нетто": "1.6",
          "Брутто": "1.62",
          "ТНВЭД": "8545909000"
      },
      {
          "Наименование": "Термопаста 1г",
          "Нетто": "0.001",
          "Брутто": "0.003",
          "ТНВЭД": "3824999609"
      },
      {
          "Наименование": "Термопаста 30г",
          "Нетто": "0.03",
          "Брутто": "0.032",
          "ТНВЭД": "3824999609"
      },
      {
          "Наименование": "Термопаста 3г",
          "Нетто": "0.003",
          "Брутто": "0.005",
          "ТНВЭД": "3824999609"
      },
      {
          "Наименование": "Термопаста 4г",
          "Нетто": "0.004",
          "Брутто": "0.006",
          "ТНВЭД": "3824999609"
      },
      {
          "Наименование": "Термопаста КПТ-8 ( 50 грамм), пр-во Россия",
          "Нетто": "0.05",
          "Брутто": "0.06",
          "ТНВЭД": "3824999609"
      },
      {
          "Наименование": "Термопаста КПТ-8 (17 грамм), пр-во Россия",
          "Нетто": "0.017",
          "Брутто": "0.021",
          "ТНВЭД": "3824999609"
      },
      {
          "Наименование": "Термоусадка 1мм",
          "Нетто": "0.005",
          "Брутто": "0.007",
          "ТНВЭД": "3921909000"
      },
      {
          "Наименование": "Термоусадка 1,5мм",
          "Нетто": "0.008",
          "Брутто": "0.01",
          "ТНВЭД": "3921909000"
      },
      {
          "Наименование": "Термоусадка 2мм",
          "Нетто": "0.01",
          "Брутто": "0.012",
          "ТНВЭД": "3921909000"
      },
      {
          "Наименование": "Термоусадка 2,5мм",
          "Нетто": "0.013",
          "Брутто": "0.015",
          "ТНВЭД": "3921909000"
      },
      {
          "Наименование": "Трубка для защиты места сварки оптических волокон",
          "Нетто": "0.025",
          "Брутто": "0.03",
          "ТНВЭД": "3917320009"
      },
      {
          "Наименование": "Ультразвуковая ванна CODYSON ",
          "Нетто": "1.75",
          "Брутто": "2.2",
          "ТНВЭД": "8479899708"
      },
      {
          "Наименование": "Ультразвуковая ванна Skymen ",
          "Нетто": "1",
          "Брутто": "1.3",
          "ТНВЭД": "8479899708"
      },
      {
          "Наименование": "Флюс  10 г",
          "Нетто": "0.01",
          "Брутто": "0.015",
          "ТНВЭД": "3810909000"
      },
      {
          "Наименование": "Флюс 30мл, пр-во Россия",
          "Нетто": "0.03",
          "Брутто": "0.035",
          "ТНВЭД": "3810909000"
      },
      {
          "Наименование": "Футляр для элементов питания",
          "Нетто": "0.024",
          "Брутто": "0.028",
          "ТНВЭД": "3923100000"
      },
      {
          "Наименование": "Шестерня мясорубки",
          "Нетто": "0.04",
          "Брутто": "0.045",
          "ТНВЭД": "8483908909"
      },
      {
          "Наименование": "Кисточка антистатическая",
          "Нетто": "0.075",
          "Брутто": "0.09",
          "ТНВЭД": "9603909900"
      },
      {
          "Наименование": "Щетка антистатическая ",
          "Нетто": "0.35",
          "Брутто": "0.45",
          "ТНВЭД": "9603909900"
      },
      {
          "Наименование": "Щетки угольные для стиральных машин, пр-во Япония",
          "Нетто": "0.05",
          "Брутто": "0.055",
          "ТНВЭД": "8545200000"
      },
      {
          "Наименование": "Скотч тканевый (Электротехническая изоляционная ацетатная лента) ",
          "Нетто": "0.035",
          "Брутто": "0.04",
          "ТНВЭД": "5906100000"
      }
  ]
}
//импорт файла из xlsx в JSON
var ExcelToJSON = function() {

  this.parseExcel = function(file) {
    var reader = new FileReader();

    reader.onload = function(e) {
      var data = e.target.result;
      var workbook = XLSX.read(data, {
        type: 'binary'
      });
      workbook.SheetNames.forEach(function(sheetName) {
        // Here is your object
        var XL_row_object = XLSX.utils.sheet_to_row_object_array(workbook.Sheets[sheetName]);
        var json_object = JSON.stringify(XL_row_object);
        lists = (JSON.parse(json_object));
        jQuery( '#xlx_json' ).val( json_object );
      })
    };

    reader.onerror = function(ex) {
      console.log(ex);
    };

    reader.readAsBinaryString(file);

  };
};

function replacement() {
  for (let i = 0; i < lists.length; i++) {
    for (let j = 0; j < date.date.length; j++)
    {
      let a = date.date[j].Наименование
      if (lists[i]['17.Вид номенклатуры'] == a) {
        lists[i]["18.Вес нетто "] = date.date[j].Нетто;
        lists[i]["19.Вес брутто "] = date.date[j].Брутто;
        lists[i]["20.ТНВЭД"] = date.date[j].ТНВЭД;
      }   
    }
  }



  
  





  //экспорт в json
  function downloadObjectAsJson(lists, exportName) {
    var dataStr = "data:text/json;charset=utf-8," + encodeURIComponent(JSON.stringify(lists));
    var downloadAnchorNode = document.createElement('a');
    downloadAnchorNode.setAttribute("href", dataStr);
    downloadAnchorNode.setAttribute("download", exportName + ".json");
    document.body.appendChild(downloadAnchorNode);
    downloadAnchorNode.click();
    downloadAnchorNode.remove();
  }

  var stockList = XLSX.utils.json_to_sheet(lists)
  var wb = XLSX.utils.book_new()
  XLSX.utils.book_append_sheet(wb, stockList, 'list1')
  XLSX.writeFile(wb, 'book.xlsx');
}
